app/views/questions/show.html.erb

SELECT "reponses".* FROM "reponses" INNER JOIN "q_to_as" ON "reponses"."id" = "q_to_as"."reponse_id" WHERE "q_to_as"."question_id" = $1  [["question_id", 1]]
---
<%= form_tag(questions_path) do %>
  <% @question.reponses.each do |reponse| %>