app/views/themes/answer.html.erb

SELECT "questions".* FROM "questions" INNER JOIN "questionnaires" ON "questions"."id" = "questionnaires"."question_id" WHERE "questionnaires"."theme_id" = $1  [["theme_id", 1]]
---
<% @themes.each do |theme| %>
  <% theme.questions.each do |question| %>

SELECT  "reponses".* FROM "reponses" WHERE "reponses"."theme_id" = $1 AND "reponses"."question_id" = $2 AND "reponses"."reponse_id" = $3 LIMIT $4  [["theme_id", 1], ["question_id", 1], ["reponse_id", 1], ["LIMIT", 1]]
SELECT "reponses".* FROM "reponses" WHERE "reponses"."theme_id" = $1 AND "reponses"."question_id" IN (SELECT "questions"."id" FROM "questions" INNER JOIN "questionnaires" ON "questions"."id" = "questionnaires"."question_id" WHERE "questionnaires"."theme_id" = $2)  [["theme_id", 1], ["theme_id", 1]]
---
        <%= question.name %><br/>
        <%= Reponse.find_by_id(question.reponse_id).name %>
        <%= Reponse.find_by_id(question.reponse_id).valeur %>