app/views/themes/show.html.erb

<ul>
  <li> <%= link_to "Commencer le test", question_path(theme_id: @theme.id, id: @theme.questions.first.id) %> </li>
---
SELECT  "questions".* FROM "questions" INNER JOIN "questionnaires" ON "questions"."id" = "questionnaires"."question_id" WHERE "questionnaires"."theme_id" = $1 ORDER BY "questions"."id" ASC LIMIT $2  [["theme_id", 1], ["LIMIT", 1]]