app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @question = Question.find(params[:id])

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "questions" SET "reponse_id" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["reponse_id", 1], ["updated_at", "2018-09-03 10:16:34.256417"], ["id", 1]]
SELECT  "questions".* FROM "questions" INNER JOIN "questionnaires" ON "questions"."id" = "questionnaires"."question_id" WHERE "questionnaires"."theme_id" = $1 AND "questions"."id" = $2 LIMIT $3  [["theme_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def create
    current_theme = Theme.find(params[:theme_id])
    current_question = Question.find(params[:question_id])
    current_question.reponse_id = params[:reponse]
    next_theme = Theme.find_by_id(params[:theme_id].to_i + 1)
    if current_question.save!
      next_question = current_theme.questions.find_by_id(current_question.id + 1)