app/controllers/themes_controller.rb

SELECT "themes".* FROM "themes"
---
  def index
    @themes = Theme.all

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @theme = Theme.find(params[:id])

SELECT "questions".* FROM "questions" INNER JOIN "questionnaires" ON "questions"."id" = "questionnaires"."question_id" WHERE "questionnaires"."theme_id" = $1  [["theme_id", 1]]
SELECT "reponses".* FROM "reponses" WHERE "reponses"."theme_id" = $1 AND "reponses"."question_id" IN (SELECT "questions"."id" FROM "questions" INNER JOIN "questionnaires" ON "questions"."id" = "questionnaires"."question_id" WHERE "questionnaires"."theme_id" = $2)  [["theme_id", 1], ["theme_id", 1]]
---
  def answer
    # @theme = Theme.find(params[:theme_id])
    # @question = @theme.questions
    @themes = Theme.all
    gon.themes = Theme.pluck(:name)

    @values = []
    @theme_points = []
    @themes.each do |theme|
      valeur_theme = 0
      theme.questions.each do |question|
        reponse_valeur = Reponse.find(question.reponse_id).valeur