app/controllers/themes_controller.rb

  def answer
    @theme = Theme.find(params[:theme_id])
---
SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]